source_folder = '解包数据/uexp'
output_folder = '打包/uexp'

target_markers = {
    '特征值1': '0983',
   # 非块自动美化特征值1: 88f1
    '特征值2': 'fd82'
   # 非块自动美化特征值1: 7af1    
}

search_values =[
     [335000100,335000700],#马的三个颜色
     [330600100,330604300],#轿车蓝-星河领航
     [330800200,330801800],# 双人摩托(棕)= 幽焰风驰摩托车
     [333600100,333603900],# 2座跑车CoupeRB= 帕加尼imola(星空蓝)
     [330100200,330101000],# buggy沙滩车(黄)= 合金龙骨（绿）
     [330400100,330404400],#吉普车-仰望u8
     [403211,413740],# 蓝色运动上衣= 幽焰骑士-维塔
     [404107,404069],#卡其色裤子=至尊金龙裤子
     [403228,413508],# 黑色伏地魔上衣= 沙丘之主-图卡盟
     [403227,413564],# 白色伏地魔上衣= 镜域双华-欧若拉
     [403226,413549],# 黄色伏地魔上衣= 墨龙九天-敖渊
     [403210,413678],# 黄色运动上衣= 精灵之光-露米娜
     [403354,413607],# 黄色名流上衣= 梦海之灵-妮芮妲
     [403222,413657],# 都市魅力套装= 宇宙意志-塞卢姆
     [403353,403598],# 湖蓝色名流上衣= 冥河战士套装
     [407003,402147],# 湖蓝色名流遮阳镜= 怪诞乔克面具
     [403351,413027],# 紫底炫彩上衣= 4AM追光队服
     [403370,453021],# 短款白绿羽绒服= 101
     [40609685,40609010],#冰河战士头发=雪国幻梦头饰
     [40609762,40609037],#海盐绵绵冰头发=梦幻火箭发饰
     [40609764,40609054],#街头风暴头发=怪诞头饰
     [402146,402143],#性感猫女面具 = 小丑红鼻头
     [407001,407081],#深蓝色名流遮阳镜 = 放客神游眼镜
     [3801001,3801022],#盔仔 = 萌酷奶龙
     [3801009,3801025],#鸡哥 = 美月兔
     [3801011,3801023],#呆呆 = 蜜桃猫
     [3801010,3801024],#啾啾 = 阿柴枸杞
     [20300800,100410003],#M416机械瞄具 = M416-墨龙九天(机瞄)
     [20500500,100410004],#M416默认枪托 = M416-墨龙九天(枪托)
     [29100400,100410002],#M416突击步枪默认弹匣 = M416-墨龙九天(弹匣)
     [28100400,100410001],#M416突击步枪默认枪口 = M416-墨龙九天(枪口)
     [29210500,905514],#p90弹夹=沙丘之主打击特效
     [403193,403592],#青年教官上衣=沙漠守护者套装
     [403197,403385],#橘黑制服上衣=都市猎人外套
     [403209,403265],#红色运动上衣=漫步者上衣
     [501001,501001010],#背包1=酷熊1
     [501002,501002010],#2=2
     [501003,501003010],#3=3
     [501004,501001009],#背包1=萌熊1
     [501005,501002009],#2=1
     [501006,501003009],#3=3
     [502001,502001012],#头盔1=国宝1
     [502002,502002012],#2=2
     [502003,502003012],#3=3
     [502004,502001001],#头盔1=金羽特工1
     [502005,502002001],#2=2
     [403220,403587],#竞技达人朋克上衣=东方飞龙套装
     [10100500,101005052 ],#-GROZA-巴啦啦小魔仙
     [10100700,101007012 ],#-QBZ-相思残雪
     [10100900,101009006 ],#-MK47-洛神天依
     [10101000,101010022 ],#-G36C-镜域双华
     [10101100,101011012 ],#-AC-VAL-梦海之灵
     [10101200,101012010 ],#-蜜獾-白蛇盈舞
     [10100100,101001116],# AKM突击步枪= AKM-幽焰骑士
     [10210500,102105035],# P90冲锋枪= P90-沙丘之主
     [10100400,101004100],# M416突击步枪= M416-墨龙九天
     [101006016,101006053],# AUG-耀粉歌者= AUG-星梦奇缘
     [101008050,101008060],# M762-天降萌叽= M762-电糖天使
     [101003035,101003101],# SCAR-L-炫彩节奏= SCAR-L-时空协奏
     [103007016,103007023],#mk14-冰河战士= 叶罗丽
     [2200101,2202608],#你好-胜者为王
     [2200701,2200990],#不行-巅峰宗师
     [2200801,2246406],# 肯定= 专属动作-幽焰骑士(LV2)
     [2200601,2234208],# 走= 星雾饕餮
]